Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.PathPointsAreTooClose(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Document,System.Double)
Returns true if the two points are too close to be adjacent start, end or waypoints in a PathOfTravel.
Remarks:
The points are too close when the distance between them is closer than the length
specified by MinimumLength plus a certain tolerance.
cda:
The document for which to compare the two points.
tolerance:
The tolerance to add to the minimum distance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.SetIgnoredCategoryIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the ElementIds for Category elements which are ignored by route calculation.
categoryIds:
The ids of Categories to be ignored by route calculation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more ElementIds in categoryIds are not valid Category element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.GetRouteAnalysisSettings(Autodesk.Revit.DB.Document)
Returns the RouteAnalysisSettings element for a given document.
Remarks:
Project documents have a RouteAnalysisSettings element, one per document.
Family documents do not have RouteAnalysisSettings elements.
cda:
The document for which to get the RouteAnalysisSettings element.
Returns:
Returns the RouteAnalysisSettings element in project documents
or null for family documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020